/*  
    1. По координатам двух точек, которые вводит пользователь, определить уравнение прямой, проходящей через эти точки.
    Общий вид уравнения: y = kx + b; где k = (y1 - y2) / (x1 - x2), b = y2 - k*x2.
*/

var x1,y1,x2,y2,k,b;
console.log('task 1\n');

x1 = prompt('Введіть x1');
y1 = prompt('Введіть y1');
x2 = prompt('Введіть x2');
y2 = prompt('Введіть y2');

console.log('(x1, y1): ('+x1+', '+y1+')');
console.log('(x2, y2): ('+x2+', '+y2+')');

k = (y1 - y2) / (x1 - x2); 
b = y2 - k*x2;

document.write('y = '+k+'·x + '+b);
console.log('y = '+k+'·x + '+b);